In [2]:
import pandas as pd
# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames
pd.set_option('display.max_colwidth', None)

Fase 1: Análisis Exploratorio de Datos (EDA)

In [3]:
# Función para leer Dataset

def leer_dataset(ruta1, ruta2, ruta3):
    df1 = pd.read_csv(ruta1)
    df2 = pd.read_csv(ruta2)
    df3 = pd.read_csv(ruta3)
    return df1, df2, df3

In [5]:
# LLamamos a la funcion leer_dataset

ruta_clientes = "clientes.csv"
ruta_productos = "productos.csv"
ruta_ventas = "ventas.csv"

df_clientes, df_productos, df_ventas = leer_dataset(ruta_clientes,ruta_productos,ruta_ventas)

In [10]:
df_clientes.head(2)

  id_cliente nombre  apellido           ciudad
0      C0001  Julia     López  Granada, España
1      C0002  Elena  Martínez  Granada, España

In [9]:
df_clientes.shape

(300, 4)

In [14]:
df_productos.head(4)

,id_producto,precio,categoria,descripcion
0,P0001,58.91 €,Clothing,6GJFfPug1voQYH3zfXItpbjwRA7VVT64DGtG8VnRXaJJZ0SYJa
1,P0002,15.67 €,Electronics,Ai3c6EdaRU5C0WuWl718dSYHakqGLiMJmpbVgn7iq6syGN3UJP
2,P0003,50.58 €,Sports & Outdoors,yMidjq8PGxKEf6YFWfUKJN1sDhyIs2xareF0uaA4ngzUgmrDKc
3,P0004,72.88 €,Sports & Outdoors,E8LBdxZItLULWZUyKPwzkjZJHD2GOSuqR7Od4DX5624ex1t5lN

In [13]:
df_productos.shape

(600, 4)

In [17]:
df_ventas.head(2)

  id_venta id_producto  cantidad       fecha id_cliente
0  V004849       P0173         4  2024-05-16      C0203
1  V003181       P0165         9  2022-09-12      C0004

In [16]:
df_ventas.shape

(80000, 5)

In [18]:
def exploracion_dataframe(dataframe):
    print(f"Los duplicados que tenemos en el conjunto de datos son: {dataframe.duplicated().sum()}")
    print("\n ..................... \n")
        
        # generamos un DataFrame para los valores nulos

    print("Los nulos que tenemos en el conjunto de datos son:")
    df_nulos_num = pd.DataFrame(dataframe.isnull().sum() / dataframe.shape[0] * 100, columns = ["%_nulos"])
    display(df_nulos_num[df_nulos_num["%_nulos"] > 0])
    
    # Nulos en columnas categóricas

    print("Los nulos que tenemos en el conjunto de datos (Categóricas) son:")
    df_nulos_cat = pd.DataFrame(dataframe.select_dtypes(include="object").isnull().sum() / dataframe.shape[0] * 100, columns=["%_nulos"])
    display(df_nulos_cat[df_nulos_cat["%_nulos"] > 0])
    print("\n ..................... \n")
    print(f"Los tipos de las columnas son:")
    display(pd.DataFrame(dataframe.dtypes, columns = ["tipo_dato"]))
    
    for col in dataframe.columns:
        print(f"La columna {col.upper()}tiene las siguientes valore únicos:")
        display(pd.DataFrame(dataframe[col].value_counts()).head(12))

In [19]:
exploracion_dataframe(df_clientes)

Los duplicados que tenemos en el conjunto de datos son: 0

 .....................

Los nulos que tenemos en el conjunto de datos son:

Empty DataFrame
Columns: [%_nulos]
Index: []

Los nulos que tenemos en el conjunto de datos (Categóricas) son:

Empty DataFrame
Columns: [%_nulos]
Index: []

 .....................

Los tipos de las columnas son:

           tipo_dato
id_cliente    object
nombre        object
apellido      object
ciudad        object

La columna ID_CLIENTEtiene las siguientes valore únicos:

            count
id_cliente
C0001           1
C0207           1
C0205           1
C0204           1
C0203           1
C0202           1
C0201           1
C0200           1
C0199           1
C0198           1
C0197           1
C0196           1

La columna NOMBREtiene las siguientes valore únicos:

        count
nombre
María      42
Ana        37
Marta      34
Sofía      33
Elena      32
Lucía      28
Laura      26
Carmen     25
Clara      23
Julia      20

La columna APELLIDOtiene las siguientes valore únicos:

           count
apellido
Rodríguez     38
López         34
García        32
Fernández     31
Martínez      30
Sánchez       29
Pérez         29
González      28
Gómez         26
Hernández     23

La columna CIUDADtiene las siguientes valore únicos:

                   count
ciudad
Lyon, Francia         24
Sevilla, España       18
Marsella, Francia     18
Zaragoza, España      17
Oporto, Portugal      17
Bilbao, España        17
Málaga, España        17
Toulouse, Francia     17
Madrid, España        16
Aveiro, Portugal      16
Coímbra, Portugal     15
Murcia, España        15